zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
// Converter initialization
void Converter_Init(void)
{
	// Set everything to 0
	memset(&converter_state, 0, sizeof(converter_state));
	//memset(&dac_settings, 0, sizeof(dac_settings));
	
	//---------- Channel 5V ------------//
	// Common
	converter_state.channel_5v.CHANNEL = CHANNEL_5V;
	converter_state.channel_5v.load_state = LOAD_ENABLE;										// dummy - load at 5V channel can not be disabled
	
	// Voltage
	converter_state.channel_5v.voltage.MINIMUM = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage setting for channel
	converter_state.channel_5v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage setting for channel
	converter_state.channel_5v.voltage.LIMIT_MIN = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage limit setting
	converter_state.channel_5v.voltage.LIMIT_MAX = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage limit setting
	
	// Current
	converter_state.channel_5v.current_low_range.RANGE = CURRENT_RANGE_LOW;						// LOW current range
	converter_state.channel_5v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	converter_state.channel_5v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	converter_state.channel_5v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_5v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	converter_state.channel_5v.current_high_range.RANGE = CURRENT_RANGE_HIGH;					// HIGH current range
	converter_state.channel_5v.current_high_range.MINIMUM = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	converter_state.channel_5v.current_high_range.MAXIMUM = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	converter_state.channel_5v.current_high_range.LIMIT_MIN = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_5v.current_high_range.LIMIT_MAX = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current limit setting
	
	//---------- Channel 12V -----------//
	
	// Common
	converter_state.channel_12v.CHANNEL = CHANNEL_12V;
	converter_state.channel_12v.load_state = LOAD_ENABLE;										
	
	// Voltage
	converter_state.channel_12v.voltage.MINIMUM = CONV_MIN_VOLTAGE_12V_CHANNEL;					// Minimum voltage setting for channel
	converter_state.channel_12v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_12V_CHANNEL;					// Maximum voltage setting for channel
	converter_state.channel_12v.voltage.LIMIT_MIN = CONV_MIN_VOLTAGE_12V_CHANNEL;				// Minimum voltage limit setting
	converter_state.channel_12v.voltage.LIMIT_MAX = CONV_MAX_VOLTAGE_12V_CHANNEL;				// Maximum voltage limit setting	
	
	// Current
	converter_state.channel_12v.current_low_range.RANGE = CURRENT_RANGE_LOW;					// LOW current range
	converter_state.channel_12v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	converter_state.channel_12v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	converter_state.channel_12v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_12v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	// 12V channel cannot provide currents > 20A (low range)
	converter_state.channel_12v.current_high_range.RANGE = CURRENT_RANGE_HIGH;					// HIGH current range
	converter_state.channel_12v.current_high_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	converter_state.channel_12v.current_high_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	converter_state.channel_12v.current_high_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	converter_state.channel_12v.current_high_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	
	
	// Overload protection
	converter_state.overload_protection_enable = 1;
	converter_state.overload_warning_enable = 0;
	converter_state.overload_threshold = (10*1);
	
	
	// Default settings for channel and current ranges
	converter_state.channel_5v.current = &converter_state.channel_5v.current_low_range;
	converter_state.channel_12v.current = &converter_state.channel_12v.current_low_range;
	converter_state.channel = &converter_state.channel_12v;
	
	
	// Apply default configuration to hardware
	// Using functions without additional checks - safe here.
	Converter_TurnOff();
	while(Converter_IsReady() == 0);
	SetFeedbackChannel(converter_state.channel->CHANNEL);
	SetCurrentRange(converter_state.channel->current->RANGE);
	SetVoltageDAC(converter_state.channel->voltage.setting);
	SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
	SetOutputLoad(converter_state.channel->load_state);
	// Overload protection mechanism uses data from converter_regulation, so no
	// 	special settings are required.
}



// Helpers

void fillDispatchMessage(converter_message_t *msg, dispatch_msg_t *dispatcher_msg, uint8_t param)
{
	dispatcher_msg->type = DISPATCHER_CONVERTER_EVENT;
	dispatcher_msg->sender = sender_CONVERTER;
	if (msg)
		dispatcher_msg->converter_event.msg_sender = msg->sender;
	else
		dispatcher_msg->converter_event.msg_sender = sender_CONVERTER;
	// CHECKME - is that required?
	dispatcher_msg->converter_event.param = param;
	dispatcher_msg->converter_event.spec = 0;
	dispatcher_msg->converter_event.err_code = ERROR_NONE;			
}


// This function is called when converter state is changed - turned ON/OFF, started/stopped charging
// Arguments are:
//		err_code - error code
//		state_event - converter state change

static void stateResponse(converter_message_t *msg, uint8_t err_code, uint8_t state_event)
{	
	// Send notification to dispatcher
	dispatcher_msg.type = DISPATCHER_CONVERTER_EVENT;
	dispatcher_msg.sender = sender_CONVERTER;
	if (msg)
		dispatcher_msg.converter_event.msg_sender = msg->sender;
	else
		dispatcher_msg.converter_event.msg_sender = sender_CONVERTER;
	dispatcher_msg.converter_event.param = param_STATE;
	dispatcher_msg.converter_event.spec = state_event;
	dispatcher_msg.converter_event.err_code = err_code;
	xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
}


static void msgConfirm(converter_message_t *msg)
{
	// Confirm
	if (msg->pxSemaphore)	xSemaphoreGive(*msg->pxSemaphore);
}
















