zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
//=========================================================================//
//	Profile command processor
//=========================================================================//
static void Converter_ProcessProfile (void)
{
	uint8_t temp8u;
	//uint8_t err_code = ERROR_NONE;
	//uint8_t op_result = 0;
	switch(msg.type) {
		//---------------- Loading profile ------------------------//
		case CONVERTER_LOAD_PROFILE:
			// Disable converter if enabled
			Converter_ProcessMainControl(CMD_INTERNAL, GET_READY_FOR_PROFILE_LOAD);
			// Load profile data
			taskENTER_CRITICAL();
			Converter_LoadProfile();
			taskEXIT_CRITICAL();
			// Wait until current feedback switching is allowed
			while(Converter_IsReady() == 0) 
				vTaskDelay(1);	
			// Apply new channel current range setting to hardware
			temp8u = Converter_SetCurrentRange(converter_state.channel->current->RANGE);
			if (temp8u == CONVERTER_CMD_OK) {
				SetVoltageDAC(converter_state.channel->voltage.setting);
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
				SetOutputLoad(converter_state.channel->load_state);
				//op_result = VALUE_UPDATED;
			}
			else {
				//err_code = ERROR_INTERNAL;
			} 
			msgConfirm(&msg);
		break;
		
		//----------------- Saving profile ------------------------//
		case CONVERTER_SAVE_PROFILE:
			Converter_SaveProfile();
			msgConfirm(&msg);
			break;
/*			//=========================================================================//
			// Loading global settings
			case CONVERTER_LOAD_GLOBAL_SETTINGS:
				Converter_LoadGlobalSettings();
				// Confirm
				if (msg.pxSemaphore != 0)
					xSemaphoreGive(*msg.pxSemaphore);
				break;
			//=========================================================================//
			// Saving global settings
			case CONVERTER_SAVE_GLOBAL_SETTINGS:
				Converter_SaveGlobalSettings();
				// Confirm
				if (msg.pxSemaphore != 0)
					xSemaphoreGive(*msg.pxSemaphore);
				break;
			//=========================================================================//
*/
		default:	// unknown
			break;
	}
}



//---------------------------------------------//
//	Charge process controller
//	
//---------------------------------------------//
static uint8_t Converter_ProcessCharge(uint8_t cmd)
{
	static uint8_t charge_state;
/*	switch (cmd)
	{
		case START_CHARGE:
			charge_state = 1;
			break;
		case STOP_SHARGE:
		case ABORT_CHARGE:
			charge_state = 0;
			break;
		case CHARGE_TICK:
			// do charge stuff
			break;
	}
*/
	// return converter output state - should it be enabled or disabled	
	return charge_state;
}



		
				
				
				
				
/*				
			//=========================================================================//
			// Turn ON
			case CONVERTER_TURN_ON:
				if ((converter_state.state == CONVERTER_STATE_OFF) || (converter_state.state == CONVERTER_STATE_OVERLOADED))
				{
					temp8u = Converter_TurnOn();
					if (temp8u == CONVERTER_CMD_OK)
					{
						converter_state.state = CONVERTER_STATE_ON;
						err_code = CMD_OK;
					}
					else
					{
						err_code = CMD_ERROR;
					}
				}
				else
				{
					// Converter is already ON
					err_code = CMD_OK;
				}
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_ON;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Turn OFF
			case CONVERTER_TURN_OFF:
				Converter_TurnOff();
				converter_state.state = CONVERTER_STATE_OFF;	// Reset overloaded state
				err_code = CMD_OK;
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OFF;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Overload
			case CONVERTER_OVERLOADED:
				// Hardware has been overloaded and disabled by low-level interrupt-driven routine.
				converter_state.state = CONVERTER_STATE_OVERLOADED;
				// Reset that routine FSM flag
				if (Converter_ClearOverloadFlag() == CONVERTER_CMD_OK)
				{
					// OK, flag has been reset.
					err_code = EVENT_OK;
				}	
				else
				{
					// Error, we should never get here.
					// Kind of restore attempt
					Converter_TurnOff();
					err_code = EVENT_ERROR;							
				}
				// Send notification to dispatcher
				dispatcher_msg.type = DISPATCHER_CONVERTER_EVENT;
				dispatcher_msg.sender = sender_CONVERTER;
				dispatcher_msg.converter_event.msg_type = 0;
				dispatcher_msg.converter_event.msg_sender = 0;
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OVERLOAD;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break; 
			//=========================================================================//
			// Tick
			case CONVERTER_TICK:		// Temporary! Will be special for charging mode
				// ADC task is responsible for sampling and filtering voltage and current
				adc_msg = ADC_GET_ALL_NORMAL;
				xQueueSendToBack(xQueueADC, &adc_msg, 0);
				break;
				
			default:
				break;
		}
	}
}
*/






/*
void bla-bla(uint8_t cmd)
{

	if (converter_state.state == CONVERTER_STATE_OFF)
	{
		switch (cmd)
		{
			case CONVERTER_TURN_ON:		
				// Command to low-level
				temp8u = Converter_TurnOn();
				if (temp8u == CONVERTER_CMD_OK)
				{
					converter_state.state = CONVERTER_STATE_ON;
					err_code = CMD_OK;
				} 
				else 
				{
					err_code = CMD_ERROR;
				}
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_ON;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;	
			case CONVERTER_TURN_OFF:	
				// Always set output load
				SetOutputLoad(LOAD_ENABLE);
				converter_state.state = CONVERTER_STATE_OFF;	// Reset overloaded state
				err_code = CMD_OK;
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OFF;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			case CONVERTER_OVERLOADED:
				// We can get here if there are simultaneous messages of turning off and overload.
				// Anyway, hardware already disabled by low-level interrupt-driven routine.
				Converter_ClearOverloadFlag();
				break;	
			case CONVERTER_START_CHARGE:
				retVal = Converter_ProcessCharge(__START__);
				if (retVal == 1)
				{
					// Command to low-level
					temp8u = Converter_TurnOn();
					if (temp8u == CONVERTER_CMD_OK)
					{
						SetOutputLoad(0);
						converter_state.state = CONVERTER_STATE_CHARGING;
						err_code = CMD_OK;
					} 
					else 
					{
						err_code = CMD_ERROR;
					}
				}
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_CHARGING;
				dispatcher_msg.converter_event.err_code = retVal | err_code;		// fixme
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
		}
	}
	else if (converter_state.state == CONVERTER_STATE_ON)
	{
		switch (cmd)
		{
			case CONVERTER_TURN_ON:		
				// Converter is already ON
				err_code = CMD_OK;
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_ON;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			case CONVERTER_TURN_OFF:	
				Converter_TurnOff();
				converter_state.state = CONVERTER_STATE_OFF;
				err_code = CMD_OK;
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OFF;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			case CONVERTER_OVERLOADED:
				// Hardware has been overloaded and disabled by low-level interrupt-driven routine.
				converter_state.state = CONVERTER_STATE_OVERLOADED;
				// Reset that routine FSM flag
				if (Converter_ClearOverloadFlag() == CONVERTER_CMD_OK)
				{
					// OK, flag has been reset.
					err_code = EVENT_OK;
				}	
				else
				{
					// Error, we should never get here.
					// Kind of restore attempt
					Converter_TurnOff();
					err_code = EVENT_ERROR;							
				}
				// Send notification to dispatcher
				dispatcher_msg.type = DISPATCHER_CONVERTER_EVENT;
				dispatcher_msg.sender = sender_CONVERTER;
				dispatcher_msg.converter_event.msg_type = 0;
				dispatcher_msg.converter_event.msg_sender = 0;
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OVERLOAD;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			case CONVERTER_START_CHARGE:
				retVal = Converter_ProcessCharge(__START__);
				if (retVal == 1)
				{
					SetOutputLoad(0);
				}
				// Confirm
				if (msg.pxSemaphore)	xSemaphoreGive(*msg.pxSemaphore);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_CHARGING;
				dispatcher_msg.converter_event.err_code = retVal;				// fixme
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
		}
	}
	else if (converter_state.state == CONVERTER_STATE_CHARGING)
	{
		switch (cmd)
		{
			case CONVERTER_TURN_ON:		
				break;	// do nothing
			case CONVERTER_TURN_OFF:	
				retVal = Converter_ProcessCharge(__STOP__);
				if (retVal == 0)
				{
					__disable_converter();
					SetOutputLoad(converter_state.channel->load_state);
				}
				break;
			case CONVERTER_OVERLOADED:
				Converter_ProcessCharge(__STOP_BY_OVERLOAD__);
				SetOutputLoad(converter_state.channel->load_state);
				break;
			case CONVERTER_START_CHARGE:
				retVal = Converter_ProcessCharge(__RESTART__);
				break;
		}
	}
	else if (converter_state.state == CONVERTER_STATE_OVERLOADED)
	{
		switch (cmd)
		{
			case CONVERTER_TURN_ON:		
				break;	
			case CONVERTER_TURN_OFF:	
				break;
			case CONVERTER_OVERLOADED:
				break;
			case CONVERTER_START_CHARGE:
				break;
		}
	
	}
	

}
*/






